[
  {
    "id": 1,
    "title": "MISSION PT 95-96: Bird pooped on my hand🐦... Gods love is REAL🧡",
    "date": "July 7, 2025",
    "description": "Yoooooo whats up, hope yall are doing well👍 These last two weeks were hype. Lots of fun, emotion, and bird poop",
    "fullContent": "\nYoooooo what's up, hope yall are doing well👍\n\nThese last two weeks were hype. Lots of fun, emotion, and bird poop\n\nBIRD POOP💩🐦✋️:\n1. And it came to pass, that as I was traveling throughout the land of Price with the intent of sharing the gospel of the lamb with those who would have not yet received it, a bird was happening to pass by from above. \n2. This creature of God let loose from its bowels, and it came to pass that it fell upon me, and was placed upon my arm. \n3. Sorrow, disgust, and anger filled my heart, which was put into my soul by him who is the author of sin. \n4. STINKY BIRD POOPED ON MY ARM...NASTY👎👎👎\n5. Nevertheless, I knew in whom I did trust, my merciful Father in Heaven. And it came to pass that I did press forward, having repented of my hatred and of my sins which did weigh upon my soul, and looked unto my redeemer, who is Christ. \n6. And it came to pass that I was once again filled with the spirit of the Lord, and did press forward to share the word of God throughout the land of Price.\n\nCAROL AND ALAYNA🌊🌊🌊:\nOur friends Carol and Alayna were baptized!!! Carol is Alayna's mom, it was so cool to be able to teach both of them together, they are such a sweet family!\n\nJAMES🌊📞⛪️:\nHad another awesome miracle happen! While we were at church, we got a text from our Stake president saying that he just had a meeting with someone who wants to be baptized! We were able to get his number and texting and set up a meeting time! We are gonna be meeting with him on Wednesday and are planning to help him set a date for his baptism. Please pray for James!!!\n\nANDREW'S BLESSING🙌☀️🕊:\nOk, time to be spiritual. This last week I had probably one of the most spiritual experiences of my mission! We went to visit Andrew, one of our friends that we were teaching.\nAs we taught him we found out that he did not believe that he was important in God's eyes. He thought that God was too busy for him, and didn't have time to care for him. We testified of God's love but Andrew wasn't taking it. He had a rough past and didn't get lots of love from his family, it was hard for him to understand what that love felt like. \nThe spirit was poking at me that he NEEDED to know of God's love now. Thankfully Elder Warfield felt the same. He offered to give Andrew a priesthood blessing. As we gave Andrew his blessing, I was able to feel this incredible power and light of love that was not mine. It was CRAZY, it was like I could literally feel my heart being opened so that I could feel a bigger stronger amount of love for Andrew. After the blessing, Andrew broke down crying. He said that he did not know he was able to feel love like that. After this he KNEW that God loved him, he knew that he was special and important to God.\nAfterwards I could not stop smiling, the feeling of Love just lingered in my heart for the longest time. GOD'S LOVE IS REAL. He knows YOU, and you are SPECIAL to Him. For those of you that read this, you NEED to know that this is true. God loves you, as if you were the only one on earth❤️\n\n\nI love you and miss you all!!!\n\nBye >:)\n",
    "imgSrc": "https://link-to-preview-image.jpg",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 2,
    "title": "MISSION PT 93-94: THE POWER OF PRAYER 💪🤝🫶",
    "date": "June 23, 2025",
    "description": "Helloooooooo. This last two weeks were awesome! TRANSFERS🏠🗺🚗 We had transfers this week",
    "fullContent": "\nHelloooooooo\nThis last two weeks were awesome!\n\nTRANSFERS🏠🗺🚗\nWe had transfers this week! We are no longer in a trio :(...BUT I get to stay with Elder Warfield!!! This transfer will be my last one, feels weird. But I'm sprinting to the end🏃‍♂️\n\nPAYSON TEMPLE⛪️🫶☀️\nWe got to go to the temple this last week! I absolutely love the temple, the spirit there is so different. As I was in the temple I thought a lot about my mission and about all the wonderful things I have been able to experience. I'm so grateful for the gospel and for the opportunity that I have to share it!\n\nMIRIC🌊🌊🌊\nOur friend Miric was baptized this week! It's been awesome teaching him and his family. This kid was able to help bring his whole family back to church! His aunt and cousin are going to be baptized next week!\n\nRUNAWAY CAT🏃‍♂️🐈👵\nWe are teaching this old lady named Barbara. Barbara's funny, she's really weird. Anyways, we stopped by for a lesson and when we opend the door, her cat booked it out the house...and she was mad :( We apologized and had our lesson, but she was still a little upset throughout the lesson. After wards we apologized again, and I was PRAYING that the cat would come back, because this lady LOVES her cat. We open  the door to leave, AND THE CAT WAS SITTING RIGHT THERE :O Prayers work, the gospel is true, Jesus Christ is my savior🤘. After that she was really happy :) Pray for Barbara because she's working on not smoking anymore\n\n\nLOVE YOU AND MISS YOU ALL!!!\n\nBYE >:)\n ",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 3,
    "title": "MISSION PT 90-92: ‼️SO MANY MIRACLES‼️",
    "date": "June 9, 2025",
    "description": "THIS WEEK HAS BEEN CRAZY!!! This week has probably been",
    "fullContent": "\nTHIS WEEK HAS BEEN CRAZY!!! This week has probably been the best and most miracle filled week of my entire mission!\n\nWe have been on the finding grind💪. This week we found 12 new people to teach and we put 8 of them on date for baptism!!!  Price is nice🤝\n\nIt's been awesome, the Lord has just been placing people in our path. Me and my companions feel like we are on a spiritual high right now lol. There has been so much going on, so many things for us to do now. And we have been finding more and more potential people to teach in the area. It's literally expoding🤯🤯🤯\n\nA cool thing I've been able to experience this week is gratitude! Although we have all these awesome miracles going on, i had to remind myself that it's not because of me or my skills or anything like that. We are receiving these people because God knows that they are ready. As a companionship we have really been focusing on gratitude, it's amazing to be able to thank God for the miracles that he gives us! \n\nI've got about 7 weeks left on my mission, and I am SPRINTING to the end! I love God, I love the Savior, and I LOVE being able to serve them! Nothing better I could be doing right now.\n\n\nI LOVE YOU AND MISS YOU ALL!!!\n\nBYE >:)\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 4,
    "title": "MISSION PT 86-89: The Three Nephites🤯",
    "date": "May 20, 2025",
    "description": "What's up, hope yall are chillin. These last couple of weeks were pretty nuts",
    "fullContent": "\nWhat's up, hope yall are chillin. These last couple of weeks were pretty nuts. I'm lazy today so it's gonna be short...\n\nTRANSFERS 🚗🗺📍:\nStill in price🤘 new comp is Elder barnes, he's hype. I've served around him before, so we know each other pretty well!\n\nTHE TRIO🙉🙊🙈:\nAbout a week in we got changed to a trio! So me and Elder barnes are now with Elder warfield, he's also hype. Cooks some bus food\n\nBLAKELY🌊🌊🌊:\nBlakely got baptized! She's hype. Fun kid\n\nLOVE YALL\n\nBYE >:)\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 4,
    "title": "MISSION PT 84-85: ‼️HE IS RISEN‼️",
    "date": "April 21, 2025",
    "description": "Hello, everyone. Hope yall had a good easter weekend :)",
    "fullContent": "\nHello, everyone. Hope yall had a good easter weekend :)\n\nEXCHANGES🚶‍♂️🚶\nHad lots of exchanges this week! We were exchanging for about 80% of our week, so that was lota of fun👍 I also got to buzz one of the elders heads which was chill\n\nBLAKELY🐶📖👊\nHad an awesome miracle this week! We ran into an old lady and she said that she has a granddaughter that wants to be baptized! So we got to meet her granddaughter Blakely, she's hype. But we were able to put her on date for may 3rd! \n\nCURTIS🐣🗿🐰 \nOur friend Curtis got baptized!!! He was baptized on easter so that was super cool! Curtis doesn't speak English, he's from china. So it's been fun to teach him with a translator. But even though there's a language barrier, Curtis and been able to find his testimony!\n\nSPIRITUAL THOUGHT☀️\nYesterday was Easter so I figured I would share a video about the ressurection of Jesus Christ!\n\nBecause of Him: An Easter Message\n\nhttps://www.churchofjesuschrist.org/study/video/easter-videos/2022-04-004-because-of-him-an-easter-message?lang=eng\n\nWatch this it's really awesome 👆👆👆\n\n\nLOVE AND MISS YOU ALL\n\nBYE >:)\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 5,
    "title": "MISSION PT 83: GENERAL CONFRENCE🤯",
    "date": "April 7 2025",
    "description": "Hellooooooooo. Had an awesome week, lots of things keeping us busy",
    "fullContent": "\nHellooooooooo\nHad an awesome week, lots of things keeping us busy!\n\nMISSION PHOTOS: https://photos.app.goo.gl/QkeZbs9mCceZNY3x9\n\nANDREA🐕🍬🤙:\nWe had an awesome lesson with our friend Andrea this week👌 We got to teach her about baptism and the importance of making covenants w God! She was telling us about how she feels like her house has something wrong with it, it was kinda creepy, she said that the feeling follows her around...BUT that then created an opportunity for us to teach her about blessings! We got to bless her home and she said that she could feel the spirit! it helped remind me how the spirit can work through me to bless others, made me happy :)\n\nELDER GOUGH VS SPICY PEPPER🌶🥵🔥:\nThere's this really good Asian place called Sakura in price. One of the Elders we serve with, Elder Gough, got and ate a really spicy pepper...it was a lot Spicer than he thought lol. He was dying while we just laughed and ate our food. He doing ok now👍\n\nAARON & QUINTON🤘🏍🎸:\nWe talked w these dudes named Aaron and Quinton. They are both covered in these crazy tattoos and had a lot of weird thoughts and ideas about religion and other weird stuff. At first I thought 'oh boy, lets get this over with', I had the idea that it just wouldn't go anywhere. But as I was thinking I had the thought come to mind, 'God loves these two so much'. And then I felt bad, I was totally judging these people... I decided to stick with the conversation, my goal was to let them know that God loves them! As we talked, the spirit actually led the conversation towards Jesus Christ and His Atonement! We got an awesome opportunity to testify of the savior and the spirit was so strong! We ended up creating a good friendship despite our differences. God loves everyone PERFECTLY!\n\nGENERAL CONFRENCE👴📖✏️:\nHad the opportunity to go to General Confrence in person this last week! It was awesome! We got to ride a fat train all the way up to salt lake with a bunch of other missionaries. There were TONS of people there! It was also kinda sad, there are also lots of people who stand outside of the conference center with the goal to destroy our faith. They have these big signs and big speakers and pamphlets that they throw everywhere with the intent to pull people away from Jesus Christ's church. But in a weird way, it actually strengthened my testimony! It reminded me of the things that I KNOW to be true. The Book of Mormon is the word of God 🤝 \n\nOH, AND SPANISH FORK IS GETTING A TEMPLE LETS GOOOOOOOOOOO🤘🤘🤘\n\nSPIRITUAL THOUGHT☀️:\nHere's one of my favorite quotes from General Confrence!\n\n'The Lord knows your divine potential and what your faith and testimony can become. He will never give up on you. Through the Atonement of Jesus Christ all that is broken can be healed.'\n- Elder S. Mark Palmer\n\nGod knows us and knows what we need! If we follow his son, Jesus Christ, we can become the person that God needs us to be! :)\n\n\nLOVE AND MISS YOU ALL\n\nBYE >:)\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 6,
    "title": "MISSION PT 81-82: BACK IN PRICE...AGAIN🤯😤💪🫂🤝",
    "date": "March 31, 2025",
    "description": "Hello hello, hope yall are doing great! These last two weeks were",
    "fullContent": "\nHello hello, hope yall are doing great! These last two weeks were awesome! I lowkey forgot half the stuff that happened, but lets hope it works out👍\n\nTRANSFERS🏜🚗🗺:\nIM BACK IN PRICE!!!🤯 For like the third time lol. For those of you who remember, I started my mission in Helper (it's a lil tiny town right above price), and then about 7 months ago I was transferred to Price for like a day and then got emergency transferred back because Elder Morgan broke his foot...BUT I WASNT FINISHED💪😤 I'm back!\n\nNEW COMP🤝🏀🙉:\nMy new comp is Elder Baltich! He's hype, we are like the same person, we gotta lot in common lol, especially our music taste👌\n\nMLC👨‍🏫📖🤙:\nWe had Mission Leadership Council this week, it was chill. Our mission president talked a lot about being unified, specifically with the savior! Jesus Christ says to 'come, follow me'. in order for us to follow him, we must be unified and do the things he would have us do👍 Oh yeah, and then Brad Wilcox pulled up out of nowhere and hung out with us for a bit, he gave me a hug🫂 \n\nSPIRITUAL THOUGHT☀️:\n'May we begin now, this very day, to express love to all of God’s children, whether they be our family members, our friends, mere acquaintances, or total strangers. As we arise each morning, let us determine to respond with love and kindness to whatever might come our way.'\n- Thomas S Monson\n\nWe are ALL God's children, he loves ALL of us perfectly! We can share God's love with others through our own actions!\n\nBE THE REASON SOMEONE FEELS LOVED TODAY🧡\n\n\nI LOVE YOU AND MISS YOU ALL🫶\n\nBYE >:)\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 7,
    "title": "MISSION PT 78-80: ALLEN IS BACK 🤯",
    "date": "March 18, 2025",
    "description": "Hellooooooo, hope yall are doing great! These last couple of weeks have been",
    "fullContent": "\nHellooooooo, hope yall are doing great! These last couple of weeks have been awesome👌👏👍 \n\nBENTLEY📖🎮🚗:\nWe recently started teaching a girl named Bentley! One of the first things she told us was that she wants to be baptized...hype. Her mom seems a little iffy but she's down to support her so that's good 👍 \n\nASTRID🐕🐴📣:\nOur friend Astrid told us that she is thinking about being baptized! She's a funny old lady with a LOT of questions about Jesus Christ's church. She also has this GINORMOUS dog, it's scary looking. This dog was bread in Africa to literally fight lions...its huge. But it seems chill, we are like 75% sure it won't kill us...\n\nEXCHANGES🚶‍♂️🚶:\nWent on exchanges with Elder Carter this week, he's a goofball, but he's super chill, he's got a mega strong testimony💪. I went to his are with him, he's srving in Minersville, close to the bottom of the mission. It was SUPER windy and cold, thought I was gonna fly away. I could literally lean against the wind and hit that one Michael Jackson move👍\n\nCRAZY LIBRARY MAN🤪👴📚:\nWhile I was in minersville with Elder Carter, we were knocking doors and we ran into this crazy old guy. He had like 3 teeth and he was totally wearing a wig. We said like three words and he just started yapping about a bunch of crazy stuff, non of it even had to do with religion. He talked at us about he was lookin at weird stuff in the library and got caught so now he's banned from using any of the libraries in the area and then he blamed it all on the liberals...weird right? He gave us some odd pamphlets too lol\n\nALLEN IS BACK💪🪶💧:\nSo about 3 months ago we were teach this guy named Allen, and Allen was GOLDEN. He was so ready for baptism and he was almost there, but then he had to move back to Arizona and we lost all contact with him. But then the other day at Church, THIS MAN WALKS INTO THE BUILDING!!! HE CAME BACK!!! We got to meet with him and he still wants to be baptized! It was awesome seeing him again, amazing Miracle👏 \n\nSPIRITUAL THOUGHT🌞:\nFrom Brad R. Wilcox\n\n'Some mistakenly receive the message that repentance and change are unnecessary. God’s message is that they are essential. But doesn’t God love us despite our shortcomings? Of course! He loves us perfectly. I love my grandchildren, imperfections and all, but that does not mean I don’t want them to improve and become all they can become. \n\nGod loves us as we are, but He also loves us too much to leave us this way.\n\n Growing up unto the Lord is what mortality is all about. Change is what Christ’s Atonement is all about. Not only can Christ resurrect, cleanse, console, and heal us, but through it all, He can transform us to become more like Him'\n\n\nI LOVE JESUS CHRIST\n\nI LOVE AND MISS YOU ALL\n\nBYE >:)\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": ["/Users/brianskousen/Downloads/received_1281650206615483.jpeg"]
  },
  {
    "id": 8,
    "title": "MISSION PT 74-77: Scary Old Guy 🙉",
    "date": "February 24, 2025",
    "description": "Helloooooooooo, sorry its been a minute since i last wrote. I got lazy. Repentance is real🤘",
    "fullContent": "\nHelloooooooooo, sorry its been a minute since i last wrote. I got lazy. Repentance is real🤘\n\nTHE TEMPLE🛕🕍⛪️:\nWe got to go to the temple with the Sweatfield family! It has been sooooo awesome being able to work with these awesome people. I literally love them so much\n\nANTHONY😀🎮🐕:\nWe have started teaching our new friend Anthony! This kid is cracked and he wants to be baptized! Only struggle is that his dad is so nervous about coming to church so it's been hard to help both of them progress. But they are doing great 👍 \n\nCRAZY OLD GUY👴🤬🚪:\nWe knocked on this one door in central valley, there was this big patch of ice that I slipped on walking up the door. After the first knock it was quiet. So we decided to knock again...after the second know we hear from inside the house 'STOP IT!!!' This yell sounded very angry, me and my comp look at each other, surprised. I'm halfway through telling him we should probably leave when we here THUMP-THUMP -THUMP-THUMP we realize that this angry man is running full speed at the door. We bolt off the front porch, i almost died again on the ice patch, and we ran to the car and flew away. Funny story\n\nWell that's about it, I'm running out to time to it'll be a short email.\n\nLOVE YALL \n\nBYEEEEEEEE >:)\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 9,
    "title": "MISSION PT 73: REALLY BIG FIRE >:D",
    "date": "January 27, 2025",
    "description": "HELLOOOOOOOO Wonderful people! This week was pretty chill🤙",
    "fullContent": "\nHELLOOOOOOOO Wonderful people! This week was pretty chill🤙\n\nMISSION PHOTOS:\nREALLY BIG FIRE🔥😛🌲:\nSo one of our wards had a activity to celebrate something...I forgot what it was...BUT I do remember that there was hotel coco and donuts :) and a really big fire. For the activity the basically made a big pile of trees and then blew it up🤯 it was hype🤘\n\nJOEY🌊🌊🌊:\nOur friend Joey was baptized this week!!! He a funny ADHD kid so he's got a lot of energy. When he got into the baptismal font he immediately jumped in and started swimming around lol. Then we was baptized, and then continued to swim around until his parents yelled at him to get out haha. \n\nGARY🇺🇲🔫🐦:\nWe started teaching Gary this week! He's literally like the first old guy that I've taught lol. But we had a great lesson about Gods love for us and the spirit was soon strong! They said they wanted to feed us dinner tomorrow so we are excited for that >:)\n\nSPIRITUAL THOUGHT:\n\nalma 26:11-12\n11 But Ammon said unto him: I do not boast in my own strength, nor in my own wisdom; but behold, my joy is full, yea, my heart is brim with joy, and I will rejoice in my God. \n\n12 Yea, I know that I am nothing; as to my strength I am weak; therefore I will not boast of myself, but I will boast of my God, for in his strength I can do all things; yea, behold, many mighty miracles we have wrought in this land, for which we will praise his name forever.\n\nLOVE YALL SO MUCH\n\nBYE >:)\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 10,
    "title": "MISSION PT 69-72: Baptism, bread, and trucks🤘",
    "date": "January 20, 2025",
    "description": "Helloooooooo, I realized that I have 204 days left... That's nuts. Anyways, here the email :) ",
    "fullContent": "\nHelloooooooo, I realized that I have 204 days left... That's nuts. Anyways, here the email :) \n\nTHE SWEATFIELDS🌊🌊🌊:\nDalton, Abel, and Grayson we all baptized!! It was amazing! They were all so happy and the spirit was soooo strong. \n\nELDER BARNEY >:) :\nMy new comp is Elder Barney!!! I served around him while I was in Spanish Fork and he is so hype. So far the transfer has been awesome with him\n\nMICHAEL📖🧑‍🎓:\nOur friend Michael is flying through the Book of Mormon right now! He wants to know if it is true, so please pray for him! \n\nBREAD🥪🍞:\nSome lady made us a fat loaf of bread and we ate it in 4 hours... \n\nTHE DITCH🚗🪝👍:\nAs we were driving to Loa, we saw some guy stuck in the snow in a ditch on the side of the road. Thankfully we have a truck so we pulled him out w our 4 wheel drive😎\n\nTRUCK BROKE🩹🛻😭:\nYeah so our truck is broken now... So no more pulling people out of ditches... The air bag system is malfunctioning, so basically the airbags won't go off if we crash... Or they will just blow up at any moment... Sadly we aren't allowed to gamble with that lol. So now we have a silly little car. Downgrade for real...\n\n\nThe mission is still the best thing ever!!!\n\n2 Nephi 4:21\n'He hath filled me with his love, even unto the consuming of my flesh'\n\nGod loves us PERFECTLY. if we turn towards Him and his son, Jesus Christ, we can be filled with this love\n\n\nMiss you and love you all!!!!\n\nBye >:) \nBYE >:)\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 11,
    "title": "MISSION PT 68: Stayin Central 🤘",
    "date": "December 31, 2024",
    "description": "Wuddup, gonna be a short email",
    "fullContent": "\nWuddup, gonna be a short email\n\nTRANSFERS🚗🗺💼:\nGot transfer news, IM STAYING!!! Elder Robertson will be moving up to Mapelton. My new comp is gonna be Elder Barney! I got to serve around Elder Barney while I was in Spanish fork, he's awesome and I'm excited to serve with him! \n\nTHE SWEATFIELDS👨‍👩‍👧‍👦🌊🤘:\nThe Sweatfield family is a miracle!!! All three of the boys are getting baptized today! I literally love this family soooooooo much, I'm so glad that I was here to help teach them! I'll get pictures soon!\n\nLOVE YALL \n\nBYE >:)\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 12,
    "title": "MISSION PT 65-67: Mariah Carey is back💪😤🎄🎅",
    "date": "December 25, 2024",
    "description": "MERRY STINKIN CHRISTMAS EVERYONE!!!",
    "fullContent": "\nMERRY STINKIN CHRISTMAS EVERYONE!!!\n\nSorry for not emailing the last couple of weeks...I forgot😀 So this email is gonna he a little long lol.  \nI made a new Google photos album with all my mission photos! Feel free to join :)\n\nNow I won't have to send a bunch of pictures in my emails, just look at the gigantic photo album :)\n\nBut it's been great! Christmas time on the mission is soooooooo good because everyone is so focused on Jesus🤘, plus there are so many activities that we can invite people to, so it's a good time to have our friends meet people from the ward! It's been awesome, let's get into it.\n\nDILIGENCE💪😤🫡:\nThis last month I've really been focusing a lot on being more diligent, which is a lot harder that I thought. Sometimes it's so tempting to take the easy route, but easy doesn't make things happen. Me and Elder Robertson have been focusing on a quote we heard, we don't know where it's from but it's bars: 'Nothing changes if nothing changes'. Change is something that is essential if we want to grow!\n\nCHRISTMAS PARTIES 🥳🎄🎅:\nThere have been tons of Christams parties! Since we cover a stake we cover 8 wards, and every ward has had a Christmas party so that mean we got to go to 8 parties...I've seen Santa at about 6 of em, so he's staying busy too. But it's been a great opportunity for us to ubcite people to these parties, tons of people came which was so awesome. \n\nTHE CONCERT 🎵🪕🎶:\nThe whole mission got tickets to a concert by Jenny Oaks Baker, so we all got to go! It's was all about Christmas and about the birth of our Savior! It's was hype, got to see a lot of friends there\n\nHEATED VESTS🔥🦺🥵:\nThe Porters got us heated vests!!!! If all don't remember, the Porters are a family we have been teaching! Their son Tayson was baptized a lil while ago and they are one of my favorite families! But yeah, during a lesson they got our some presents they were heated vests! It's pretty chilly outside so they have been sooooo awesome, you just charge a battery pack thingy and turn it on and then the vest gets warm. It's probably gonna be my favorite Christmas gift this year\n\nPAETYNS BAPTISM🌊🌊🌊:\nOur friend Paetyn got baptized this week! Her family, the Jensens, are so awesome! We have been working together for a while and now they are all working towards being sealed in the temple!!! So awesome \n\nHOT WHEELS🚗🔥🛞:\nFunny story, this last Sunday there was this kid, who was about 7-8, at church whearing this gigantic beanie. Every time this beanie would move, it would rattle...I was very confused. About halfway through the  sacrament, this kid takes of his beanie...AND ABOUT 7 HOT WHEELS (yes, the little tiny cars) FALL OUT OF HIS HAT! He quickly dropped to the floor to scoop the cars back into his hat and the pops the beanie back on his head with it once again full of hot wheels. For those of you that don't know, sacrament meeting is supposed to be a very sacred and reverent time...I was dying...the hot wheels situation caught me so off guard and I was trying so hard not to laugh. It was crazy. I will now always remember hot wheels kid. I love church so much lol.\n\nSTEVE ❄️🧓🎄:\nSteve is hype! We met him a couple of days ago and he's so cool! He's old so he was complaining about the snow and ice all over his driveway and sidewalk, he call it 'frozen death' cause he kept slipping on it. But we came by again to shovel his driveway and he loved it! It was a really good experience, serving people just makes you feel so good :)\n\nSPIRITUAL THOUGHT🎄:\n\nAlma 7:7, 9-13\n\n7 For behold, I say unto you there be many things to come; and behold, there is one thing which is of more importance than they all—for behold, the time is not far distant that the Redeemer liveth and cometh among his people. \n\n9 But behold, the Spirit hath said this much unto me, saying: Cry unto this people, saying—Repent ye, and prepare the way of the Lord, and walk in his paths, which are straight; for behold, the kingdom of heaven is at hand, and the Son of God cometh upon the face of the earth. \n\n10 And behold, he shall be born of Mary, at Jerusalem which is the land of our forefathers, she being a virgin, a precious and chosen vessel, who shall be overshadowed and conceive by the power of the Holy Ghost, and bring forth a son, yea, even the Son of God. \n\n11 And he shall go forth, suffering pains and afflictions and temptations of every kind; and this that the word might be fulfilled which saith he will take upon him the pains and the sicknesses of his people. \n\n12 And he will take upon him death, that he may loose the bands of death which bind his people; and he will take upon him their infirmities, that his bowels may be filled with mercy, according to the flesh, that he may know according to the flesh how to succor his people according to their infirmities. \n\n13 Now the Spirit knoweth all things; nevertheless the Son of God suffereth according to the flesh that he might take upon him the sins of his people, that he might blot out their transgressions according to the power of his deliverance; and now behold, this is the testimony which is in me.\n\nREMEMBER THE TRUE MEANING OF CHRISTMAS :)\n\n\nLOVE YOU AND MISS YOU ALL!!!\n\nBye >:)\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 13,
    "title": "MISSION PT 63-64:",
    "date": "December 2, 2024",
    "description": "Sheesh...lots has happened these last couple of weeks👍 let's get into it",
    "fullContent": "\nSheesh...lots has happened these last couple of weeks👍 let's get into it\n\nMOVING APARTMENTS🏠->🛖\nWe moved to a different apartment. Sadly this means no more four pad, so now it's juts me and Elder Robertson living here. It's a nice place...except for the cold water...in the middle of winter. The first day we had no heat in the house, I don't think I have ever taken a faster shower haha. Now it's all heated up👍 so we won't have to torture ourselves every morning :D\n\nTHE SICKNESS 😷 🤧 😫 \nI got mega sick last week, this was the first time on my mission I had to stay inside and not work because I was sick. It was so boring, I hate being sick. I remember when I was little I lowkey liked being sick cause then I didn't have to work and go to school. But now it's the opposite...working is fun\n\nELDER CHRISTOFFERSON🌟🧓✨️\nWe had the amazing opportunity to have Elder D. Todd Christofferson (one of the 12 apostles) come to speak to our mission!!! It was awesome!\n✨️spiritual thought✨️\nWhile we were visiting with him we got to have some time where we could ask Elder Christofferson some questions. One missionary asked him about feeling inadequate. Elder Christofferson simply replied that we are inadequate, and that's we we need Jesus Christ! Jesus is here to help us overcome our inadequacies and weaknesses, it's not always easy but if we stay diligent and rely on Jesus Christ and his atonment then everything will be OK in the end. Ether 5:12\n\nTAYSON🌊🌊🌊\nOur friend Tayson got baptized!!! We have been working with them for a while and they are just so awesome. Definitely one of my favorite families! \n\nCUT MY FINGER 👉 🔪 \nI was cutting up some chicken this week and cut my thumb pretty good 👍 I forgot how useful thumbs are. It's so annoying so being able to grab stuff lol\n\nTHANKSGIVING🍗🍁🦃🍂\nThanksgiving was awesome! I love food so much...one of my new favorite foods is bannana cream pie. So yummy 😋 We gotta spend lots of time with the members in our stake, lots of fun\n\nMOVING OUR FRIENDS📦 🚗 🏠 \nWe helped some of our friends move into their new apartment! We has the ward come by and help out so we got a lot done in a short time. The kid that we are teaching is super cool, she wants to get baptized really bad so we are hoping to set up something soon!\n\n\nBut yeah that's all for this week, so far so good 👍 \n\nOk love yall \n\nBye >:)\n\n",
    "imgSrc": "https://lh3.googleusercontent.com/pw/AP1GczPbhxXLZ7aogEPLTKWVfzwQBxUJYOdPdA2LSV9XSKVZqNrFVPEr2_Ua_L1dkru38zUA1k6s_M9hSaodm7ik9K9Xv_zBe5ECSKKKUVP_3R79HwOOcSHinLxg_MMVXdUncxwqwybpOtljHRhYbNixal-u=w1042-h1390-s-no?authuser=0",
    "imgAlt": "",
    "images": [
  "https://lh3.googleusercontent.com/pw/AP1GczPbhxXLZ7aogEPLTKWVfzwQBxUJYOdPdA2LSV9XSKVZqNrFVPEr2_Ua_L1dkru38zUA1k6s_M9hSaodm7ik9K9Xv_zBe5ECSKKKUVP_3R79HwOOcSHinLxg_MMVXdUncxwqwybpOtljHRhYbNixal-u=w1042-h1390-s-no?authuser=0"
]
  },
  {
    "id": 14,
    "title": "MISSION PT 62: Staying in Central 💪😤🤘",
    "date": "November 19, 2024",
    "description": " What's up, hope all is well! This week was pretty simple, nothing too crazy",
    "fullContent": "\n\n What's up, hope all is well!\nThis week was pretty simple, nothing too crazy\n\nEXCHANGES 🚶‍♂️🚶‍♂️\nWent on an exchange with Elder Draper up in Fillmore! This is Elder Drapers first transfer but he seemed to be doing great! He's a lot of fun, we have a lot in common.\n\nTEMPLE WITH SIENNA🕍😃\nWe got to go to the temple with one of our recent converts, Sienna! It was awesome! We went to the Manti temple, it's super old. It was absolutely freezing tho\n\nTRANSFER NEWS🗺🚗\nI will be staying in Richfield/Central Valley with Elder Robertson!!!! This last transfer went be sooooo fast, definitely my fastest one by far. But I'm excited to stay, this are is the best🤘\n\nFRIENDS🙉❤️\nThe friends that we are teaching are doing great! Our friend Tayson will be getting baptized this week! We have been working with him and his family and they are so awesome. I just absolutely love teaching so much! The gospel is so awesome, I have seen it bless so many lives. It literally just bring joy, joy is the best 👌 \n\nSorry this one's short\nLOVE YOU AND MISS YOU ALL\n\nBYE >:)\n\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 15,
    "title": "MISSION PT 61: Grayson got baptized >:)",
    "date": "November 11, 2024",
    "description": "Sup, honestly not a whole lot happened this week so this email is gonna be pretty short👍",
    "fullContent": "\n\n Sup, honestly not a whole lot happened this week so this email is gonna be pretty short👍\n\nGRAYSON🌊🌊🌊:\nOur friend Grayson got baptized!!! This kid is hype. He's kinda crazy but it was sooo fun teaching him. His dad hasn't been active since he was little, but we got to help his dad too! Hus dad Shane was able to receive the priesthood and was able to baptized his son!!! They are literally some of the nicest people ever, love em so much.\n\nOther than that, I'm still doing great! I hit 14 months not too long ago which is so weird. I really just wanna make sure that I give it my all for the short time that I have left\n\nOk, love yall\n\nBye >:)\n\n\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 16,
    "title": "MISSION PT 59-60: 'NEVERTHELESS'",
    "date": "November 5, 2024",
    "description": "What's up yall, hope all is well :) These last two weeks have been crazy",
    "fullContent": "\n\n What's up yall, hope all is well :)\nThese last two weeks have been crazy! Lots has been happening! Richfield is literally one of the coolest places in Utah, I love it so much. It is also starting to get really really cold, so I'm excited for that.\n\nTAYSON\nWe got to meet with our friend Tayson this week he is super cool. He is Nine years old and wants to be baptized so we put him on date for the 23rd. He's a super sweet kid, a little shy, but he's lots of fun!\n\nALLEN\nWe put our friend Allen on date for the 23rd also. He is a miracle. We met him last week and the lord has just prepared him so much. He has been through some tough times and has been able to recognize that jesus christ helps us overcome those trials! We asked him about baptism.And he said that's something he wants to work towards!\n\nFROG EYE SOUP\nWe had what's called frog eye soup... I know it sounds strange...BUT It is actually Really good! There is actually no frog eyes in the soup, thankfully. It's just made out of these weird circle noodles and you mix it with a lot of pineapple juice or something like that. But it ended up tasting really good!\n\nHALLOWEEN\nHalloween was a lot of fun! Me and Elder robertson got to dress up as ghosts for one of our missionary meetings. So we got drippy outfits, unny pictures, it was hype.\n\n'NEVERTHELESS'\nThe definition of 'Nevertheless' means: 'Despite anything to the contrary'. This word is probably my favorite word rn. In the Book of Mormon 2 Nephi 4:16-28, the prophet Nephi talks about his weaknesses, his sins, his trials, and how he feels inadequate. These are pretty normal things to feel as human beings. But the most powerful part of this scripture is when Nephi uses 'nevertheless'. He is able to completely overcome all of his negative feelings and thoughts, and he then focuses on his trust in God. He focuses on the blessings that he has, the miracles that he has seen, and the love that God has for him. This is letterally one of my favorite scriptures ever. We can all use the word 'nevertheless' to change out mindset and to focus on the good things in the world. Satan doesn't want us to be happy, he wants us to be sorrowful and distracted from God's love. I would just like to invite you all to use 'nevertheless' in your life. Focus on the good instead of the bad, rely on your Heavenly Father and the Savior Jesus Christ and I promise that you will fund Joy!\n\nHUGGING DRUNK PEOPLE\nWe got hugged by a drunk guy this week. He smelled really bad... but he was really nice! We invited him to church! He said he might be there, but we aren't actually sure because he was drunk. Then for the rest of the evening we smelled like the drunk guy. I love my mission so much.\n\nKINDNESS\nI had an experience this week that helped me realize the importance and the power of kindness. I think it is so awesome that each and every one of us has the potential to just be kind to other people. It sounds so simple and it really is, but the outcome is absolutely incredible! Kindness and love is the one thing that the world will always need more of. I just think it is so cool that we are able to help people feel that love! We can help people feel seen and heard, We can help them know that they are important and that they are loved. Being kind is so awesome! It is definitely not always easy, But doing hard things only makes us become stronger! \n\n'We do need all our compassion, empathy, and love as we interact with those around us'\n- Dale G. Renlund\n\n\nI LOVE AND MISS YOU ALL!!!\n\nBYE >:)\n\n\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 17,
    "title": "MISSION PT 58: looking for homeless people 😀",
    "date": "October 21, 2024",
    "description": "Hey everyone, hope all are doing well! This week was awesome! Lots of fun. Richfield is just so great",
    "fullContent": "\n\nHey everyone, hope all are doing well! This week was awesome! Lots of fun. Richfield is just so great\n\nPETER...THIS GUY IS WACK 😦🤯:\nSo this last week, we started teaching this cool old guy named John. We gave him a Book of Mormon and he said that he's been reading it. We weren't actually sure how interested he was, seemed like he was just being nice but we set up another time to come by. When we come by his son Peter is there, and he wants to join the lesson. We are like ' this is awesome, another person to teach!' But no...we were very wrong...This guy didn't bash us or anything, but it. Was. Wack. He started talking about how he's seen Adam and he fought with God and how he joined the Egyptian gods and how he has had visions and knows about all of the powers on the earth and how he is above all human beings in knowledge and something about sperating his consciousness from his mind. He just talked about all this crazy stuff. The scary part was that we could not feel the spirit AT ALL while he was there...it was weird. The funny part was that this dude looks like a hill billy. Dirty greased up hands, long hair, sunburns, old baseball cap, Jean vest, jeans, and some cowboy boots. He was the last person we would have expected to start talking about all this lol. Basically we got outa there and aren't sure if we will be back.\n\nEXCHANGES🚶‍♂️‍➡️🚶🏼‍➡️:\nGot to go on an exchange with ELDER MORGANNNN!!! If all remember he was my compa not too long ago, he broke his foot so he had to be on medical leave, but he's back!! And he came back as an assistant!!! So now he's an assistant to the president! The assistants go on exchanges with all of the zone leaders so I got to go with him. It was awesome being with him again, he's literally one of my best friends. He's so fun.\n\nSNOW ❄️:\nIt snowed this week! It got really cold super fast so we got to have some snow! The only problem is that the mission was doing a car fast that day, so we got to walk around in the snow. \n\nLOOKING FOR A HOMELESS GUY🧙‍♂️🔎😤:\nSo we ran into this homeless guy named Dylan, he was super cool. He never really k ew much about God so we got to teach him about prayer and how we can grow our relationship with God. We gave him a book of mormon, and then he told us where his tent was so we could stop by again and teach him more. Probably one of the weirdest things I've done. We literally when on a hike looking for this guys house in the middle of nowhere...we couldn't find it. But it was fun tho. Found some cool bones of something that died or was eaten. Maybe we will eventually run into him again\n\n\nQuote by Karl D. First from this last general confrence:\n\n'You might know something secret about yourself that makes you feel unlovable. However right you might be about what you know about yourself, you are wrong to think that you have put yourself beyond the reach of God’s love. We are sometimes cruel and impatient toward ourselves in ways that we could never imagine being toward anyone else. There is much for us to do in this life, but self-loathing and shameful self-condemnation are not on that list. However misshapen we might feel we are, His arms are not shortened. No. They are always long enough to “[reach our] reaching” and embrace each one of us'\n\nGod loves you a whole lot, no matter what\n\n\n\nOK that's about it\n\nLOVE YALL\n\nBYE >:)\n\n\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 18,
    "title": "MISSION PT 56-57:",
    "date": "October 14, 2024",
    "description": "Waddup yall. Back at it again with another email 🤘 I'm currently writing this",
    "fullContent": "\n\nWaddup yall. Back at it again with another email 🤘 I'm currently writing this in the middle of a Wingers, waiting for my sticky finger wrap. Wingers is buss👍\n\nGENERAL CONFERENCE 👴⛪️📖:\nGeneral conference was HYPE this last week! It was sooooo good. It talked tons and tons about coming closer to the savior, knowing your identity as a child of God, and feeling Jesus Christ's and God's love. I got tons of notes🤓\n\nPUMKIN🎃💪:\nWe carved pumpkins for play, it was hype🤘 when we brought them to the apt elder gatchell dropped his lol. I gotta picture >:)\n\nTRANSFERS 🚗🗺📍:\nI've left Spanish fork...again...😭😭😭 it's literally been one of my favorite areas, the people there are so awesome 👌 \nBUT...now I am in the great town(s) of CENTRAL VALLEY🤘‼️ Basically my area covers Richfeild, Central Valley, and Annabell. It's just a lot of cool small town vibes here, so the complete opposite of Spanish fork. But there's a lot of old people here, they are either super cool or super weird, no in between lol. But the members here are awesome, super missionary minded.\n\nELDER ROBERTSON🤙:\nNew companion!!! Elder Robertson is awesome. He's been on his mission a couple months less than me so we are pretty close. He's been in central valley for a while so he knows everything about it. \n\nSIENNA🌊:\nOur friend Sienna got baptized! She and her family are fun. One thing about Sienna is that she has super bad anxiety...so being baptized in front of a lot of people was very scary for her. BUT...she did it! She was terrified Basically the whole time, but she told us that she wanted to do it, because she knew that it was important! Her faith gave her courage, and she did it! And then the Sunday after Siennas brother asked us if he could get baptized next month! They are so awesome!\n\n\nHonestly that's about it, Central Valley is awesome, I'm excited to be here! There is lots of work to do🤘I love it!\n\nOK LOVE YALL!!!\n\nBYE >:)\n\n\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 19,
    "title": "MISSION PT 54-55: broken ankles (not really) and buzzed heads",
    "date": "September 30, 2024",
    "description": "What's up yall. I buzzed my head >:)",
    "fullContent": "\nWhat's up yall. I buzzed my head >:)",
    "images": ["https://lh3.googleusercontent.com/pw/AP1GczMHgXSaxTOZN76xjCmSAlw6G3F8p0W_kcYfilokxMYsLO4SKQ3bqNuCs7951V44ma96gwHSWBSSqeD1QtGc3c0KK1HcJDRu1skElBhkFLXjW2Ptwel-mK1wiYkW-8SjtJ9FVrdNgtqSE3-_RC_9B99o=w1042-h1388-s-no?authuser=0"],
    "fullContent1": "\n\nit look kinda goofy but its ok, i still love myself 👍\n\nAnyways, this week has been good! Lots of fun\n\nEXCHANGES 🚶‍➡️🚶‍♂️‍➡️:\nWent on exchanges w elder Warfeild this week, he's hype. He's like a super good chef so he made some delicious food\n\nANKLE PROBLEMS 🦶:\nI sprained my Ankle pretty bad this week. We were playing basketball, i went to bloke and i missed...and then I landed on someone's foot and my ankle did the stianky leg. It's doing better now but now all my toes hurt which is weird. The nurse also got mad at me because I was playing in my vans and that I don't have any basketball shoes...\n\nRIDGELINE 🏠🏫🛖🏘:\nThere's these apartments in our area that are brand new and we are knocking through the whole thing. THERE IS TONS OF POTENTIAL HERE. Lots of people are new here so we get to talk to tons of people about the gospel👍\n\nPATRICK 👶🧔🐻:\nWe started teaching patrick this week! He's hype, he's got a baby girl, she's funny. But we talked a lot with him about faith and how faith gives us power! Faith is the first principle of the gospel because we can do anything unless we have faith. It's the first step in growing your testimony. We are planning on meeting with him later today!\n\nHonestly can't remember too much else, but it was a good week👍\n\n\nI LOVE YOU ALL!!!\n\nBye >:)\n\n\n\n",
    "imgSrc": "https://media.newyorker.com/photos/616a0ed5f9c7cf02c89a94cb/master/pass/Shouts-BaldManifesto.jpg",
    "imgAlt": ""
    
  },
  {
    "id": 20,
    "title": "MISSION PT 52-53: halfway there... :(",
    "date": "September 16, 2024",
    "description": "I hit a year this last week... That's so weird. I've been a missionary for a whole entire year. It has definetly gone by way too fast lol",
    "fullContent": "\nI hit a year this last week... That's so weird. I've been a missionary for a whole entire year. It has definetly gone by way too fast lol. \n\nit's crazy to think about the progress I've made in just a year. The experiences\n\nLOCKING MY STUFF ON ACCIDENT 🔒🔑:\nSo I accidentally locked my stuff in one of the rooms in another Elders apartment... They had to call the landlord so he could break down the door lol. But I got it back so it's hype💪\n\nCAR RAN OUTTA GAS🚗🚶🥱:\nSo because of my smart brain I forgot to fill up the car. We ran outta gas in the middle of the road, so all the citizens of Spanish Fork got to see the locan missionaries pushing their car lol. Some people just honked at us(thanks for the support), eventually so dude ran up and helped us punch it to a gas station. He was cool👍\n\nEXCHANGE🚶🚶:\nWent of an exchange w one of our assistance Elder Day, he's hype. Talked to some crazy people, they got really mad at us because we knocked on their door. Supposedly we were only allowed to knock twice... At least that's what she told us lol. Idk how we were supposed to know that... \n\nELINA🌊🌊🌊:\nELINA GOT BAPTIZED!!! Her dad TJ got baptized a couple of weeks ago and he was able to baptize her! It was awesome, spirit was strong and they were so happy!!! \n\nSAMANTHA👾💫🙆🏻‍♀️:\nWe started teaching Samantha this week! She is awesome, she basically has everything going avainster her right now. Her parents and friends are mad at her for meeting with us, but she was telling us that when she sits and thinks about it, meeting with us 'feels right'. So she wants to continue learning!!! We were able to help her learn that the good feeling she is feeling is the holy ghost!\n\n\nBut yeah that was it for the last two weeks, it's been hype. I got one more year so I'm gonna make the most of it💪\n\nLOVE YALL❤️\n\nBYE >:)\n\n\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 21,
    "title": "MISSION PT 51: Back in Spanish Fork???",
    "date": "September 2, 2024",
    "description": "Sup everyone. Im back in spanish fork lol...i was in price for a out a day, ill explain in the email👍",
    "fullContent": "\nSup everyone. Im back in spanish fork lol...i was in price for a out a day, ill explain in the email👍\n\nIN PRICE W ELDER SCHMIDT 🏜🗺:\nK, so i got sent to price. Price. Is. Awesome. I was only there for about a day but it was fun! My comp was Elder Schmidt, hes hype. OH, AND WE HAD A TRUCK!!! IT WAS HYPE!!! Theres a college campus that we cover there so i got to go back to my old BYU days and chat with college students, cool thing is that majority of them arent members! So theres a lot more work there. While i was there we talked to some old lady who was really nice. But, turns out she removed her records...she loves missionaries tho. But she basically told us that its ok if we arent obedinet lol, she was like 'its ok to get home late, its ok to sleep in, its ok to stay in your apartment and do nothing, its ok to hate your companions, its ok to not want to do anything important' blah blah blah blah. This lady sucks lol...none of that is ok, we recieve SO MANY BLESSINGS just from being obedient. Cause God recognizes those little efforts that you make, and he WILL bless you! So for the other missionaries reading this, DONT BE DISO!!!\n\nET BACK TO SPANISH FORK...NEW COMP ELDER GATCHELL‼️🤠🇨🇱:\nOk now to the nitty gritty...so i was in Price for a bit, and the i got emergency transfered back to my area is spanish for lol. Basically, if yall remember that my last comp Elder Morgan broke his foot, he had to get surgery. So he is on medical leave right now, but the surgery was really simple so he will be back is a couple weeks👍 So this means ill be 6 monthing my area!!! And im with Elder Gatchell now! He was my District Leader before but he got called as a Zone Leader, but hes hype. We got matching shirts, ill send a pic, its hype.\n\nNEKOTA🌊🌊🌊: \nOur friend Nekota got baptized!!! It was awesome :) hes a super shy kid so he was scared of doing everything in front of everyone. But he did it though! It had evryobe including us sign his Book of Mormon!\n\nBut yeah, this week was exciting. This next transfer us gonna be epic🤘\n\nOK I LOVE AND MISS YOU ALL\n\nBYE >:)\n\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 22,
    "title": "MISSION PT 48-50: A whole lotta stuff...",
    "date": "August 27, 2024",
    "description": "What's up. Sorry I didn't email last couple weeks, I got busy lol. But, these last weeks were",
    "fullContent": "\nWhat's up. Sorry I didn't email last couple weeks, I got busy lol. But, these last weeks were awesome. I don't have too much time so I'll try and make it quick👍\n\nEXCHANGES🚶‍♂️‍➡️🚶‍➡️:\nWent on an exchange w Elder Gatchell, he's cool. He's from Texas so he thinks that everything in Texas is better lol (in-n-out is better than whataburger) But we had fun tho, we ran into cheese the cat again. Haven't seen her since I was serving in the river stake🐈\n\nMASON 🛴:\nCool miracle happened this week! We were stopping by a bishops house to update them on a friend that we were teaching in their ward, as we left some kid (14-16 yrs old) pulls up to us on his scooter. He looks a little nervous but he asks us if we knew where he could get some scriptures (we definitely do) So we head over to our car to get him some and we find out that he's not a member! We asked him why the sudden interest in scriptures, cause kids his age usually don't care to much about religion, and he told us that he was praying and that he really felt like he needed to start reading the scriptures! We were able to give him a Book of Mormon and we told him about how that book will change his life. As we testified the spirit was so strong, he had an excited smile on his face as we did so so I know that he was feeling the spirit too. He let us know where he lived so we could stop by again, only problem is that he isn't have a number we could contact so we haven't been able to meet with him again...we will just keep knocking his door tho. But yeah super cool kid, awesome experience🤘\n\nELDER PEARSON 📖🧠🤯: \nSo Elder Pearseon, the Utah Area President (missionary work stuff), came and spoke with us during zone council. It was so hype. He's super serious but also funny at the same time, very straight to the point. But he talked with us about discipleship and bow we can become more aligned with the savior. It was so good, I left feeling that I need to become a better person, so I'm gonna do that👍\n\nELDER MORGAN BROKE HIS FOOT🏨🤕:\nSo my companion broke his foot...playing basketball lol. We went and got Xrays and hes got a crack on the very outside bone of his foot. Now he's gotta boot on and hops around everywhere, we are going to the doctors today to get his foot looked at👨‍⚕️\n\nTJs BAPTISM 🌊🌊🌊:\nTJ GOT BAPTIZED!!!! Tj and his family are literally some of my favorite people ever! His baptism was awesome, the spirit was so strong. Last week we got to go to the temple with him!!! Him and his wife absolutely loved it, they are so happy because of the gospel. I love them :)\n\nMORE MISSIONARY STUFF 📖🔍👌:\nWe have found a lot of new people to teach this week! We put two of them on date for sometime in September...I also just realized that I hit a year soon...uh oh...ANYWAYS, the people is Spanish Fork are so awesome! \n\nTRANSFERS 🚗🗺🧳:\nWe got Transfer news yesterday...IM GOING TO PRICE!!!!! If anyone remembers price is near my first area, so ill be over the zone that covers Helper!!! Sadly that means I'm leaving Spanish Fork :( I don't want to just yet but I'll go wherever the Lord needs me I guess lol.\n\n\n\nWell that's about it. Sorry I tucked at emailing the last couple weeks, I'll be better (hopefully). \n\nMoroni 7:33\n'And Christ hath said: If ye will have faith in me ye shall have power to do whatsoever thing is expedient in me'\n\nOK LOVE AND MISS YOU ALL!!!\n\nBye >:)\n\n\n",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  },
  {
    "id": 23,
    "title": "",
    "date": "",
    "description": "",
    "fullContent": "",
    "imgSrc": "",
    "imgAlt": "",
    "images": []
  }
]
